test.yml
config:
  target: http://localhost:8000
  phases:
    - duration: 60
      arrivalRate: 5
scenarios:
  - flow:
      - post:
          url: /categories
          headers:
            Content-Type: application/json
          json: {}
  - flow:
      - get:
          url: /categories
          headers:
            Content-Type: application/json
  - flow:
      - put:
          url: /categories/{category_id}
          headers:
            Content-Type: application/json
          json: {}
  - flow:
      - delete:
          url: /categories/{category_id}
          headers:
            Content-Type: application/json
  - flow:
      - post:
          url: /products
          headers:
            Content-Type: application/json
          json: {}
  - flow:
      - get:
          url: /products/{product_id}
          headers:
            Content-Type: application/json
  - flow:
      - put:
          url: /products/{product_id}
          headers:
            Content-Type: application/json
          json: {}
  - flow:
      - get:
          url: /products
          headers:
            Content-Type: application/json
  - flow:
      - get:
          url: /products/{product_id}
          headers:
            Content-Type: application/json
  - flow:
      - delete:
          url: /products/{product_id}
          headers:
            Content-Type: application/json
  - flow:
      - post:
          url: /customers
          headers:
            Content-Type: application/json
          json: {}
  - flow:
      - get:
          url: /customers
          headers:
            Content-Type: application/json
  - flow:
      - get:
          url: /customers/{customer_id}
          headers:
            Content-Type: application/json
  - flow:
      - put:
          url: /customers/{customer_id}
          headers:
            Content-Type: application/json
          json: {}
  - flow:
      - delete:
          url: /customers/{customer_id}
          headers:
            Content-Type: application/json
  - flow:
      - post:
          url: /orders
          headers:
            Content-Type: application/json
          json: {}
  - flow:
      - get:
          url: /orders/{order_id}
          headers:
            Content-Type: application/json
  - flow:
      - delete:
          url: /orders/{order_id}
          headers:
            Content-Type: application/json
  - flow:
      - put:
          url: /orders/{order_id}
          headers:
            Content-Type: application/json
          json: {}
  - flow:
      - get:
          url: /orders/report/{customer_id}
          headers:
            Content-Type: application/json
  - flow:
      - get:
          url: /orders/customer/{customer_id}/report
          headers:
            Content-Type: application/json